[{"title":"100 Laps with Penguin facts daily until agility pet - Day 97","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108gauf\/100_laps_with_penguin_facts_daily_until_agility\/","url":"https:\/\/i.redd.it\/1rwm0n9b99ba1.png","created_at_timestamp":"2023-01-10 01:00 PM","created_at_date":"2023-01-10"},{"title":"OSRS Hate Square (fixed)","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1082bpe\/osrs_hate_square_fixed\/","url":"https:\/\/i.redd.it\/14uw8savp5ba1.png","created_at_timestamp":"2023-01-10 01:06 AM","created_at_date":"2023-01-10"},{"title":"Think I got everything important finally built in my house! Corp here I come","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1082hpx\/think_i_got_everything_important_finally_built_in\/","url":"https:\/\/i.redd.it\/9f3872e597ba1.jpg","created_at_timestamp":"2023-01-10 01:15 AM","created_at_date":"2023-01-10"},{"title":"Do I hit her with it boys?","content":"Images don't screenshot I guess. Was just a Mr. Bean face lmao","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108gtlr\/do_i_hit_her_with_it_boys\/","url":"https:\/\/i.imgur.com\/Q3JXIjg.jpg","created_at_timestamp":"2023-01-10 01:21 PM","created_at_date":"2023-01-10"},{"title":"Me going to be knowing my acc is safe because I don’t do risky things","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108gv1u\/me_going_to_be_knowing_my_acc_is_safe_because_i\/","url":"https:\/\/i.imgur.com\/vstVLwX.jpg","created_at_timestamp":"2023-01-10 01:22 PM","created_at_date":"2023-01-10"},{"title":"Short memory","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108gww9\/short_memory\/","url":"https:\/\/i.redd.it\/b6cfjbj5d9ba1.png","created_at_timestamp":"2023-01-10 01:24 PM","created_at_date":"2023-01-10"},{"title":"New Skill- Exploration","content":"  Hello! \n\nI wanted to give you my idea what could be an introduction to  OSRS as the new skill that will be coming up and wanted to get your feedback on it. I Have had this Idea  for a few years since they first introduced the idea of sailing. I have also been a long-time fan of the  Dungeoneering skill in RS3 thinking it was great to have a skill that had every other skill needed to be  successful. The Name of the skill would be called Exploration. \n\n I think the greatest part in OSRS is being able to explore the game when you first start.  Unfortunately, with how long the game has been out and most of the player base being the same  people that played the game back when it was first released in the early 2000s pretty much every nook  and cranny of this beloved game has been explored. My skill idea of Exploration would revitalize  exploring OSRS in a way that has never been done before. This skill would be a combination of  Dungeoneering and Sailing. \n\n OSRS has vast oceans which could be easily filled with islands. These islands would have special  mobs and resource spawns and even quests. However, to reach these you would be skilled enough in  exploration to reach them. To level this skill, you would have to participate in explorations. There would  be 2 initial types of expeditions that you could join that would be placed at all the ports in the game.  Easy explorations starting at Port Serim up to Master that would leave from Relleka. These two types of  expeditions would be profitable explorations and patron explorations. Profitable would be like hunting  down bounties on bandits that have escaped to an offshore island and need to be hunted down or hunt  down strong beasts that attacked a village. Profitable explorations would be less experience per hour  while the patron ones would be more experience per hour.  \n\nThe main game play loop for this skill would be that you would set sail on an expedition to a  randomly generated island. Every island would have a different goal that would be needs to be  completed. These can range from a massive variety and would always have room to add more. Some  would be bounty hunts, monster hunts including land monsters and sea monsters, retrieving holy relics for various religious groups, defending villages in a pest control style of wave defense. And endless other  ideas.  You and your group of up to six individuals would look at the expedition board and then board a  ship after picking one. As you may know the sea is a very dangerous place, far too dangerous to bring  person possessions with you as they be lost on the high seas. This is where the dungeneering aspect  mixes into the skill. Your ship, based on how much you have upgraded it with resources and your  expedition skill level, would hold all the basic tool you would need. Hammer, saw, chisel, pickaxe, axe, and the other tools. Starting off with all bronze and be able to upgrade up to dragon. The ship could be  upgraded in many ways. Increase haul integrity, storage space, and even on deck ballista to aid you in  hunting sea monsters and protecting villages.  \n\nYou would start off gathering materials on the island to make weapons and armor. And fish or  hunt small to large creatures for food. During the gathering process you would be exploring the island  and looking for whatever the objective of the expedition would be. Due to the nature of the randomly  generated island, you could have small islands with vast caverns that you must work your way through  or sprawling plains, mountains and forests. There would be a vast number of creatures that would fill  these biomes. In these environments there would be obstacles that you would need all your skills to  transvers. Agility to jump gaps or squeeze through cervices, strength to move boulders, magic to break  seals, rune crafting to energize mystic locks, thieving to bypass traps, and so on. The versatility of this  skill is what would make it stick out. You can train every skill in RuneScape in this manner. Although it  would be much slower than training them the traditional ways. The main reward from completing expeditions would be experience in the Exploration skill. You  would also receive money for the bounty type of explorations. However, you would also receive a third reward. Exploration points. \n\nThese points would be spent on upgrading your ship and upgrade your  equipment.. Exploration points would also be used on cosmetic upgrades for tools, armors, and weapons to show off  how much of the world you have uncovered. From bronze to dragon would have (ex) attached to it with its own unique look. \n\nThe biggest thing you can also spend your points on would be a huge change in OSRS. This is quite controversial, but I feel this would be a good opportunity to bring in the tool belt. You  would upgrade your tool belt after unlocking it from basic up to master. These would not be easy to  achieve upgrades and the skill would be very slow to level, on par with runecrafting and would require all the other skills in the game to be successful. This would be one of the most rewarding.  I would love to hear some feed on what you think about this idea. I have spent a lot of time  thinking this up and if you think it is a good idea, I would love you to share it with your friends and  spread the idea around and maybe even get it to be added to the game.  Thank you so much for your time!","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108gyup\/new_skill_exploration\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108gyup\/new_skill_exploration\/","created_at_timestamp":"2023-01-10 01:27 PM","created_at_date":"2023-01-10"},{"title":"New Skill Proposal: Inscription (Audio Narration and TL;DR in comments.)","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108gz26\/new_skill_proposal_inscription_audio_narration\/","url":"https:\/\/www.reddit.com\/gallery\/108gz26","created_at_timestamp":"2023-01-10 01:27 PM","created_at_date":"2023-01-10"},{"title":"Runescape tinder... I know none of you are swiping left","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108gyu2\/runescape_tinder_i_know_none_of_you_are_swiping\/","url":"https:\/\/i.redd.it\/i9ey52g2e9ba1.png","created_at_timestamp":"2023-01-10 01:27 PM","created_at_date":"2023-01-10"},{"title":"Whats next!!??","content":"what next guys? recently done a lot mm2 ds2 99 mage range HP, fire cape barrows gloves, maxed house, Vorkath head done, and 800m bank and a lot more, what to do next?( don't say max your stats because I'm not going for that I looking for something more interesting).","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108hbfe\/whats_next\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108hbfe\/whats_next\/","created_at_timestamp":"2023-01-10 01:41 PM","created_at_date":"2023-01-10"},{"title":"New Quest","content":"Does anyone know what the requirements are for the new quest being released?","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1082yq6\/new_quest\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/1082yq6\/new_quest\/","created_at_timestamp":"2023-01-10 01:42 AM","created_at_date":"2023-01-10"},{"title":"what next guys? recently done a lot mm2 ds2 99 mage range HP, fire cape barrows gloves, maxed house, Vorkath head done, and 800m bank and a lot more, what to do next?( don't say max your stats because I'm not going for that I looking for something more interesting).","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108hckc\/what_next_guys_recently_done_a_lot_mm2_ds2_99\/","url":"https:\/\/i.redd.it\/0hj199uug9ba1.png","created_at_timestamp":"2023-01-10 01:42 PM","created_at_date":"2023-01-10"},{"title":"Join my cc if you want a chill place?","content":"Don't really know anyone who plays. I am an iron man just grinding skills looking for people to chat with maybe make the grinds a bit less boring. IGN: EmberHunter if you're interested. Ironman and non ironmen welcome. Beginners or experienced players are welcome as well.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108hdom\/join_my_cc_if_you_want_a_chill_place\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108hdom\/join_my_cc_if_you_want_a_chill_place\/","created_at_timestamp":"2023-01-10 01:43 PM","created_at_date":"2023-01-10"},{"title":"Help brainstorm account name for our Freezer iPad F2P Ironman","content":"My partner and I just got an iPad 10 for our fridge to fake having a smart fridge (*got a* ***stupid huge*** *discount at work so it was &lt;$150 and cheaper than most android tablets on amazon*) and we decided we're going to create an account just for the freezer iPad.\n\nWe're going to make it an Ironman purely for the lulz, and currently we'll be keeping it f2p for the time being, but we're not against *one day maybe* making it p2p if we use it enough\n\nISO fun name ideas, goooo.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108hnbk\/help_brainstorm_account_name_for_our_freezer_ipad\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108hnbk\/help_brainstorm_account_name_for_our_freezer_ipad\/","created_at_timestamp":"2023-01-10 01:54 PM","created_at_date":"2023-01-10"},{"title":"Looking for cc members(Had to repost errors with reddit account)","content":"[removed]","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108hro0\/looking_for_cc_membershad_to_repost_errors_with\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108hro0\/looking_for_cc_membershad_to_repost_errors_with\/","created_at_timestamp":"2023-01-10 01:59 PM","created_at_date":"2023-01-10"},{"title":"Why isn’t the Scythe worth more?","content":"Tbow and Shadow clock in at over 1 bil, but the Scythe is sitting around 375M. Is it just not as useful?","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108hzcv\/why_isnt_the_scythe_worth_more\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108hzcv\/why_isnt_the_scythe_worth_more\/","created_at_timestamp":"2023-01-10 02:08 PM","created_at_date":"2023-01-10"},{"title":"It's time we receive the Ultimate Quality of Life Update","content":"Player made Customizable Setups will allow us to spend less time at the bank and more time playing the game.\n\nMany of you may be familiar with the 'bank tabs' or 'inventory setup' Plugins for RuneLite. Well I believe its time those plugins get adopted into the game and expanded upon. \n\nGive us the ability to create equipment and inventory setups that allow us to click one button and instantly be geared for whatever activity we desire  \n\nAllow us to store many of these setups.\n\nGive us the agility to share the setups with others simply through a chat link. We then click the link for an ingame pop-up displaying the setup and options such as edit, save, ect...\n\nThis would allow us to not only waste less time but also share and discuss setups with others.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1083g6g\/its_time_we_receive_the_ultimate_quality_of_life\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/1083g6g\/its_time_we_receive_the_ultimate_quality_of_life\/","created_at_timestamp":"2023-01-10 02:11 AM","created_at_date":"2023-01-10"},{"title":"How does he Veng without using his spell book?","content":"[removed]","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108i20l\/how_does_he_veng_without_using_his_spell_book\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108i20l\/how_does_he_veng_without_using_his_spell_book\/","created_at_timestamp":"2023-01-10 02:11 PM","created_at_date":"2023-01-10"},{"title":"I had a nightmare I got PKed after getting 3rd age helm and…boots?","content":"I know 3rd age boots don’t even exist, but I basically was deep wildy skulled in dharoks while finishing a master clue and got two shotted by an ice barrager who said nothing but “fucked” after he killed me. I need a break.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108i2s3\/i_had_a_nightmare_i_got_pked_after_getting_3rd\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108i2s3\/i_had_a_nightmare_i_got_pked_after_getting_3rd\/","created_at_timestamp":"2023-01-10 02:12 PM","created_at_date":"2023-01-10"},{"title":"I got the mathematically worst possible easy clue reward","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108i6vb\/i_got_the_mathematically_worst_possible_easy_clue\/","url":"https:\/\/i.imgur.io\/BKIyqjw_d.webp?maxwidth=640&amp;shape=thumb&amp;fidelity=medium","created_at_timestamp":"2023-01-10 02:16 PM","created_at_date":"2023-01-10"},{"title":"I got the mathematically worst possible easy clue reward","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108i9ff\/i_got_the_mathematically_worst_possible_easy_clue\/","url":"https:\/\/i.imgur.com\/BKIyqjw.png","created_at_timestamp":"2023-01-10 02:19 PM","created_at_date":"2023-01-10"},{"title":"Facts","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108ibx4\/facts\/","url":"https:\/\/i.redd.it\/d4snf7ei5bba1.jpg","created_at_timestamp":"2023-01-10 02:22 PM","created_at_date":"2023-01-10"},{"title":"Steel Dragons in the Catacombs of Kourend","content":"I was assigned to kill 45 and was hyped cos i got a dragon defender but the only way to get there is to go past two gangs of Brutal Red and Blue Dragons that killed me, I took appropriate anti-dragon methods but they still destroyed  me as I was crossing the stones with consistent 20s now idk what to do, I don't want to die to those hellspawns, why are my steel dragons locked behind those things?","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1083rdz\/steel_dragons_in_the_catacombs_of_kourend\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/1083rdz\/steel_dragons_in_the_catacombs_of_kourend\/","created_at_timestamp":"2023-01-10 02:30 AM","created_at_date":"2023-01-10"},{"title":"So from my understanding if you get hacked and then your account is used for RWT and banned you cannot appeal it?","content":"[removed]","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108iqg3\/so_from_my_understanding_if_you_get_hacked_and\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108iqg3\/so_from_my_understanding_if_you_get_hacked_and\/","created_at_timestamp":"2023-01-10 02:38 PM","created_at_date":"2023-01-10"},{"title":"Why does Jagex their players for playing the game?","content":"I spent a long time building my account and making gp pvming and pvping. I don’t have a lot of gp but I had enough to bring great gear to rev caves. It’s a steady ping world where I have no problems. I’m risking 30m-90m if smites for ags. Find my vene target, attack, and then it starts skipping. Next thing you know, I’m freezing him, my screen freezes again, and then everything speeds up and now there’s a triple splat above my head and I’m dead. Is it the servers? What is going on. I spend all this time to just instantly lose my risk to lag, and osrs won’t do anything about the gear which I understand. It just hurts man.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108iskj\/why_does_jagex_their_players_for_playing_the_game\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108iskj\/why_does_jagex_their_players_for_playing_the_game\/","created_at_timestamp":"2023-01-10 02:40 PM","created_at_date":"2023-01-10"},{"title":"These guys asked if they could reset agro on my world, I said yes and so they started stacking the monkeys for me. Thanks gents!","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108iur4\/these_guys_asked_if_they_could_reset_agro_on_my\/","url":"https:\/\/i.redd.it\/2nqxm0ddr9ba1.png","created_at_timestamp":"2023-01-10 02:43 PM","created_at_date":"2023-01-10"},{"title":"Recovered my hacked account! Nothing too crazy but they did train my slayer which was nice :)","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108iy5d\/recovered_my_hacked_account_nothing_too_crazy_but\/","url":"https:\/\/www.reddit.com\/gallery\/108iy5d","created_at_timestamp":"2023-01-10 02:47 PM","created_at_date":"2023-01-10"},{"title":"Or alternatively just a private instance with the already existing ammonite crabs. Just lock it behind some stupid requirement like 2 defence and 80 woodcutting or something.","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108j4uw\/or_alternatively_just_a_private_instance_with_the\/","url":"https:\/\/i.imgur.com\/RSoxvfz.png","created_at_timestamp":"2023-01-10 02:54 PM","created_at_date":"2023-01-10"},{"title":"What do you guys do when stuff like this happens? Hurts.","content":"I spent a long time building my account and making gp pvming and pvping. I don’t have a lot of gp but I had enough to bring great gear to rev caves. It’s a steady ping world where I have no problems. I’m risking 30m-90m if smites for ags. Find my vene target, attack, and then server starts skipping. Next thing you know, I’m freezing him, my screen freezes again, and then everything speeds up and now there’s a triple splat above my head and I’m dead. Is it the servers? What is going on. I spend all this time to just instantly lose my risk to lag, and Jagex won’t do anything about the gear which I understand. It just hurts man. I want to learn and better gear helps with this, but to just lose it all and go back to square one? I love this game but man. Also do not say to RWT because I’d rather not lose my account lol.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108j4lx\/what_do_you_guys_do_when_stuff_like_this_happens\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108j4lx\/what_do_you_guys_do_when_stuff_like_this_happens\/","created_at_timestamp":"2023-01-10 02:54 PM","created_at_date":"2023-01-10"},{"title":"Bought bonds on the wrong game, is RS3 to OSRS gold swapping a thing still or?","content":"Just returned to the game for the first time in a while, like 6\/7 years I think, wondering what I can do about this","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108jbqt\/bought_bonds_on_the_wrong_game_is_rs3_to_osrs\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108jbqt\/bought_bonds_on_the_wrong_game_is_rs3_to_osrs\/","created_at_timestamp":"2023-01-10 03:01 PM","created_at_date":"2023-01-10"},{"title":"One of my art on friendos desk mat👀","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108jcca\/one_of_my_art_on_friendos_desk_mat\/","url":"https:\/\/i.redd.it\/g9ae0q0pcbba1.jpg","created_at_timestamp":"2023-01-10 03:02 PM","created_at_date":"2023-01-10"},{"title":"OSRS droprate math help","content":"I'm looking to work out the probability of getting *any* unique from a drop table but my brain isn't working today. Let's take the uniques from Kril: Steam Battlestaff \/ Spear: 2\/127, hilt \/ sotd: 2\/508, godsword shards: 3\/762.\n\nWhat is the probability of killing Kril and getting any of the above? And how do I work it out?","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108jddv\/osrs_droprate_math_help\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108jddv\/osrs_droprate_math_help\/","created_at_timestamp":"2023-01-10 03:03 PM","created_at_date":"2023-01-10"},{"title":"In an ideal world, what would a proper Jagex Customer Support Team look like, and what would be their powers ?","content":"From my understanding (although I could be wrong), Jagex doesn’t currently have an internal Customer Support team, instead relying on an external company which handles the Jagex Support Twitter (and since they don’t know quite as much about the game and have limited access, they are often not super helpful).\n\nIf we were in an ideal world where Jagex had unlimited funding and thus would decide to have an internal Customer Support team, how big would such a team be (and covering how many timezones), but most importantly, what kind of access would they have to enact their support (ie, thr ability to lock a compromised account) ?","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108jhty\/in_an_ideal_world_what_would_a_proper_jagex\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108jhty\/in_an_ideal_world_what_would_a_proper_jagex\/","created_at_timestamp":"2023-01-10 03:08 PM","created_at_date":"2023-01-10"},{"title":"Is runescape worth playing without a membership?","content":"Text","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108jjto\/is_runescape_worth_playing_without_a_membership\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108jjto\/is_runescape_worth_playing_without_a_membership\/","created_at_timestamp":"2023-01-10 03:10 PM","created_at_date":"2023-01-10"},{"title":"wen evrybuddy has lava cape but u ._.","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1084gnk\/wen_evrybuddy_has_lava_cape_but_u\/","url":"https:\/\/i.redd.it\/cm71povlc6ba1.png","created_at_timestamp":"2023-01-10 03:13 AM","created_at_date":"2023-01-10"},{"title":"Why make the “pure account builds” proposal so intricate?","content":"What was proposed is essentially to change the game completely due to specific account builds.\n\nWhy wasn’t it proposed more simply with zero effects on the game?\n\nHere is a simplified list of ideas:\n\n- Create a toggle effect in the setting menu that will prevent you from being able to switch to defense combat style in the weapon. This just makes it to where someone doesn’t accidentally click defensive style.\n\n- I know they wanted to create a place where those accounts are recognized with badges. Then do the badges and have the selected choice of account for the badge. All this would do is show a badge and strike through the quests\/activities on menu list that would give defense, prayer, and\/or HP, etc. experience for that specific account build choice. This doesn’t effect anything with the game, only makes sure to show what the account should stay away from and not have the account accidentally complete a quest that would give them that experience they do not want. These things could also be toggled.\n\n- I mean that’s pretty much it. It really is simple to not break the game and do what they wanted. This doesn’t allow the pures to do content they should not be able to do. This doesn’t allow pures to not gain a certain type of experience after completing a quest that would have given them that experience. All this does is restricts the account for what the account wants to be restricted towards and makes it safer so that the player doesn’t mess the account of their choice up.\n\nThoughts?","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108jt1v\/why_make_the_pure_account_builds_proposal_so\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108jt1v\/why_make_the_pure_account_builds_proposal_so\/","created_at_timestamp":"2023-01-10 03:20 PM","created_at_date":"2023-01-10"},{"title":"A cult necklace","content":"Add a necklace drop that gives a 5% mage dps bonus dropped by dust devils.\n\nThat is all","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108k0e3\/a_cult_necklace\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108k0e3\/a_cult_necklace\/","created_at_timestamp":"2023-01-10 03:28 PM","created_at_date":"2023-01-10"},{"title":"Had a fun slayer task - how common is this?","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108kd58\/had_a_fun_slayer_task_how_common_is_this\/","url":"https:\/\/i.redd.it\/asi09vl22aba1.png","created_at_timestamp":"2023-01-10 03:41 PM","created_at_date":"2023-01-10"},{"title":"Probably the most cringe interaction I've had on this game lmao","content":"[removed]","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108kuyq\/probably_the_most_cringe_interaction_ive_had_on\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108kuyq\/probably_the_most_cringe_interaction_ive_had_on\/","created_at_timestamp":"2023-01-10 04:01 PM","created_at_date":"2023-01-10"},{"title":"Yeah dude I have no idea what irony means. You wearing a fedora while you’re at it?","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108l17p\/yeah_dude_i_have_no_idea_what_irony_means_you\/","url":"https:\/\/i.redd.it\/nxxjoejeobba1.jpg","created_at_timestamp":"2023-01-10 04:08 PM","created_at_date":"2023-01-10"},{"title":"(NOOB) Please help me understand. I see that Masori Body requires 30 defence, but also 80 range. It's such a gap between those two requirements !! And then on top of that, when I look at the stats, the armour is really bad compared to even basic Rune plate body. So what's really the point ???","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108l7d9\/noob_please_help_me_understand_i_see_that_masori\/","url":"https:\/\/i.redd.it\/1ny94np18aba1.png","created_at_timestamp":"2023-01-10 04:14 PM","created_at_date":"2023-01-10"},{"title":"Returning player looking for a tl;dr of the last few years of OSRS","content":"Hello! I am just getting back into OSRS for the first time in a few years (I stopped playing shortly after Alchemical Hydra came out) and was looking for a quick rundown of all the major updates\/bosses\/things I should probably know for sure that have came in the last few years of updates.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108ldem\/returning_player_looking_for_a_tldr_of_the_last\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108ldem\/returning_player_looking_for_a_tldr_of_the_last\/","created_at_timestamp":"2023-01-10 04:21 PM","created_at_date":"2023-01-10"},{"title":"my broke ass trying to train construction","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108lehc\/my_broke_ass_trying_to_train_construction\/","url":"https:\/\/i.redd.it\/5sk2h9lm6aba1.png","created_at_timestamp":"2023-01-10 04:22 PM","created_at_date":"2023-01-10"},{"title":"I thought I’d show off my new shirt bought from Artistic Imp on Etsy!","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108lfv9\/i_thought_id_show_off_my_new_shirt_bought_from\/","url":"https:\/\/i.redd.it\/55dtj2s7rbba1.jpg","created_at_timestamp":"2023-01-10 04:23 PM","created_at_date":"2023-01-10"},{"title":"Clothiery","content":"Clothiery\n\nDuring the Middle Ages clothiers were one of the most regarded professions. It became the heart of Englands trade as it created more wealth and employment then any other industry at its time. One out of seven people were employed in the trade and over a quarter of all households were helping in production.\n\nAnother great example is Arte Di Calimala, the guild of cloth finishers. Part of the guilds of Florence which controlled arts and trades between the 12-16th century. This was huge for them. They had iron rods around the town for keeping standards for tools between members. Armed protection for their shops and trading centres paid out of pocket.\n\nHow does this play a part in our game as a new skill? Well I see it as a way to create a new space, where we trade the raw materials needed for the skill. The skill will produce new materials not seen in-game also ONLY to be traded within the guild. Creating some type of off g\/e way of trading. Even if it’s just the physical space would be ideal to making the system work.\n\nThe raw materials are then worked into items providing unique bonuses and making the improved version untradeable. 200 monsters\/3min prayer regen, 2+ str bonus for 2mins every 15mins of combat.\n\nMaybe having a materiel board that changes twice daily offering items important for the skill by offering in bulk. Say 1m logs = intricate material you would need for a chestplate. \n\nMaterials needed should also be able to be changed manually to foster and provoke people to try out new areas and old content.  Good use of boss heads here I’m sure of it.\n\n\nSo what are the main take-always? \n\nIt’s an independent skill which relies on items already in-game giving them another way to be sold to others and worked into useful items. \n\nIt’s a great gold and item sink that provides players with a fun way to use and look at new items.\n\nMy vision is people would try to hold onto stupid and useless items like potato seeds and bronze armour to see if the guild members would offer a more compelling price. And if it didn’t the guilds inter-city system would provide me a way to still obtain obscure items for use within the skill just through other means.\n\n\n\nThanks for reading, I have been thinking about this a lot a work. And honestly man’s needs a break. I wasn’t going to post because I’m too old for this game and my thoughts are grimy but I love the game too much and I know how much ya’ll work off creativity. I wish I could be more coherent or write a little more in-depth but that’s just not my thing.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108llbj\/clothiery\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108llbj\/clothiery\/","created_at_timestamp":"2023-01-10 04:29 PM","created_at_date":"2023-01-10"},{"title":"Theatre of Blood Entry Mode (Help needed)","content":"Hey guys :D  \n\n\nI only need 2 more quests for my quest cape and one of them is A night at the theatre. But i just suck at PvM so much, so i would really need some help for the fight and someone to carry me through it.\n\nIs there someone who could help me with it and carry me through one entry mode? I would give 1 mil for it, cause im really quite desperate lol\n\ni have pretty high combat stats, but i just dont like raids and PvM at all.\n\nYou can message me here or just add me directly in the game, so we could arrange something - Gertstrudel\n\n&amp;#x200B;\n\nThanks in advance :)","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108lmpg\/theatre_of_blood_entry_mode_help_needed\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108lmpg\/theatre_of_blood_entry_mode_help_needed\/","created_at_timestamp":"2023-01-10 04:31 PM","created_at_date":"2023-01-10"},{"title":"good ol drop from wyrms","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108lon6\/good_ol_drop_from_wyrms\/","url":"https:\/\/www.reddit.com\/gallery\/108lon6","created_at_timestamp":"2023-01-10 04:33 PM","created_at_date":"2023-01-10"},{"title":"How do you feel jagex is handling power creep in OSRS","content":"Title","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108lq3w\/how_do_you_feel_jagex_is_handling_power_creep_in\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108lq3w\/how_do_you_feel_jagex_is_handling_power_creep_in\/","created_at_timestamp":"2023-01-10 04:34 PM","created_at_date":"2023-01-10"},{"title":"Is solo GOTR extremely inconsistent, or am I doing it wrong?","content":"I'm having like a 50% success rate soloing Guardians of the Rift and it's very frustrating. My strategy is (I have 79 RC so access to all the portals):\n\n&amp;#x200B;\n\n* Start by building the north barrier, mine at the east remains until 30 seconds left (I usually end up with around 120 fragments which is enough 95% of the time)\n* Craft a weak guardian, make an inv full of essence and grab a weak core to strengthen the barrier before the first portal\n* Hit the first portal, craft, hit the second portal to get a core, then to the huge guardian to mine essence (if I get an overcharged core in the first two rotations before the guardian portal I build another guardian, otherwise I upgrade the barrier once and make strongest possible guardian)\n* Alternate portal rotations between crafting essence and runecrafting, prioritizing highest possible core over rune type or elemental\/catalytic balance\n* Use overcharged cores to build guardians until I have a strong barrier, then upgrade barrier\n* Skip crafting runes if necessary to get an overcharged core for barrier\/guardian upgrades\n* Skip rotation if only weak\/medium cores available\n* Always go for the huge guardian portal ASAP to mine essence\n\nI feel like I'm doing it pretty optimally (I've got about 40 successful games), but it just feels so luck-dependent. Sometimes I'll get several rotations in a row of just weak\/medium cores and then my game is just shot. Does anyone have any advice for anything I could be doing better?","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1085u07\/is_solo_gotr_extremely_inconsistent_or_am_i_doing\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/1085u07\/is_solo_gotr_extremely_inconsistent_or_am_i_doing\/","created_at_timestamp":"2023-01-10 04:41 AM","created_at_date":"2023-01-10"},{"title":"Do we really need the new skill to sink items when the GE already kind of solved this?","content":"Title","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108m269\/do_we_really_need_the_new_skill_to_sink_items\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108m269\/do_we_really_need_the_new_skill_to_sink_items\/","created_at_timestamp":"2023-01-10 04:47 PM","created_at_date":"2023-01-10"},{"title":"Phosani Spoon","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108m6um\/phosani_spoon\/","url":"https:\/\/i.redd.it\/dq477yzheaba1.png","created_at_timestamp":"2023-01-10 04:52 PM","created_at_date":"2023-01-10"},{"title":"Oops i think he is broken","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/10860vn\/oops_i_think_he_is_broken\/","url":"https:\/\/v.redd.it\/f9aojkylu6ba1","created_at_timestamp":"2023-01-10 04:54 AM","created_at_date":"2023-01-10"},{"title":"Young Thug just completed desert treasure","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108mamb\/young_thug_just_completed_desert_treasure\/","url":"https:\/\/i.redd.it\/bebgn3s4xbba1.jpg","created_at_timestamp":"2023-01-10 04:56 PM","created_at_date":"2023-01-10"},{"title":"Change COX cape to include normal mode","content":"Doing both TOA &amp; COX with friends new to the game\n\nalways a good time, but I always think during COX, why can't this be like TOA\n\nI'd love to semi-casually work towards the 2k cape while playing with newer friends etc. With scouting etc, I think the time difference isn't too crazy","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108mh5m\/change_cox_cape_to_include_normal_mode\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108mh5m\/change_cox_cape_to_include_normal_mode\/","created_at_timestamp":"2023-01-10 05:03 PM","created_at_date":"2023-01-10"},{"title":"Runescape Tinder, I know some of you are swiping right 👀","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1086ajk\/runescape_tinder_i_know_some_of_you_are_swiping\/","url":"https:\/\/i.redd.it\/u2s2xubix6ba1.jpg","created_at_timestamp":"2023-01-10 05:11 AM","created_at_date":"2023-01-10"},{"title":"Committed To The Grind","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108mp2u\/committed_to_the_grind\/","url":"https:\/\/v.redd.it\/4osif2ttzbba1","created_at_timestamp":"2023-01-10 05:12 PM","created_at_date":"2023-01-10"},{"title":"Is kodai wand worth it?","content":"I'm currently using just the master wand for auto casting and I have enough to buy the kodai wand and be comfortable with the spare money, should I do the upgrade? Is it worth it?","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108mpav\/is_kodai_wand_worth_it\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108mpav\/is_kodai_wand_worth_it\/","created_at_timestamp":"2023-01-10 05:12 PM","created_at_date":"2023-01-10"},{"title":"Damn","content":"[removed]","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108mrla\/damn\/","url":"https:\/\/i.redd.it\/7fwwy12c0cba1.jpg","created_at_timestamp":"2023-01-10 05:14 PM","created_at_date":"2023-01-10"},{"title":"How do I zoom out the minimap?","content":"I have runelite and people are saying you just gotta scroll, but it doesn't do anything, and the minimpa plugin doesnt haven an option for scroll, just to hide and then colours. Was this feature removed?","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108mrog\/how_do_i_zoom_out_the_minimap\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108mrog\/how_do_i_zoom_out_the_minimap\/","created_at_timestamp":"2023-01-10 05:15 PM","created_at_date":"2023-01-10"},{"title":"Runescape Tinder, I know some of you are swiping right 👀","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1086o2y\/runescape_tinder_i_know_some_of_you_are_swiping\/","url":"https:\/\/i.redd.it\/na6c4igw17ba1.jpg","created_at_timestamp":"2023-01-10 05:34 AM","created_at_date":"2023-01-10"},{"title":"Me, Trying to get a Santa hat in 2008 as a silly teenager XD","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108nbdp\/me_trying_to_get_a_santa_hat_in_2008_as_a_silly\/","url":"https:\/\/i.redd.it\/crrsvrezlaba1.png","created_at_timestamp":"2023-01-10 05:35 PM","created_at_date":"2023-01-10"},{"title":"2277, but it's wintertodt KC. . . .","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108nbt0\/2277_but_its_wintertodt_kc\/","url":"https:\/\/i.redd.it\/hh6bj1dfmaba1.png","created_at_timestamp":"2023-01-10 05:36 PM","created_at_date":"2023-01-10"},{"title":"Can you imagine a world without ironmen?","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108nflq\/can_you_imagine_a_world_without_ironmen\/","url":"https:\/\/www.youtube.com\/watch?v=rbb_E0F9POk","created_at_timestamp":"2023-01-10 05:40 PM","created_at_date":"2023-01-10"},{"title":"[Suggestion] Create a quest for gnomes to win and end the Battle of Khazard. Gnome Mans Land.","content":"title","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108nmll\/suggestion_create_a_quest_for_gnomes_to_win_and\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108nmll\/suggestion_create_a_quest_for_gnomes_to_win_and\/","created_at_timestamp":"2023-01-10 05:47 PM","created_at_date":"2023-01-10"},{"title":"When you ask for a world in Thievinghost cc and someone replies \"W404\"","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1086vsn\/when_you_ask_for_a_world_in_thievinghost_cc_and\/","url":"https:\/\/i.redd.it\/rew6uhb547ba1.png","created_at_timestamp":"2023-01-10 05:48 AM","created_at_date":"2023-01-10"},{"title":"Ely 22 KC on Official GIM","content":"Shaking....","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108not3\/ely_22_kc_on_official_gim\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108not3\/ely_22_kc_on_official_gim\/","created_at_timestamp":"2023-01-10 05:49 PM","created_at_date":"2023-01-10"},{"title":"I miss the time Jagex was brave enough to make content, not every player will experience","content":"Back in the day with content such as GWD bosses, Fight Caves (Jad specifically), Inferno (Zuk specifically), ToB, etc. This was content that most players (at the time of release) wouldn't experience. \n\nI feel today when they make the content they want as many people as possible to experience, which makes sense, why make content most people won't play through? ToA has such a huge scaling difficulty basically everyone can get through it and kill the final boss.\n\nBut there is something missing with this, players might not have experienced ToB, but they will have seen people doing it, on youtube, twitch etc. And they will see people talking about it. This makes players motivated. They have this huge task they have to work up to, but it is doable.\n\nI first experience ToB in around 2020, this was 2 years after its release. But it has stuck with me ever since, I always wanted to do it from looking at people playing it, and hearing people saying how fun it is\/rewarding it is. \n\n\nWhen I first entered it to seriously start doing it, it felt like a big epic challenge, Jagex has laid for me. Like the ending of an epic fantasy movie. And when the final boss finally goes down, it feels amazing. Not only because I finally beat the challenge Jagex made years ago, and I have been working on doing ever since, from getting my PvM skill better but also getting skills\/gear. But this is also gave me a kc, which meant I could now more easily get into groups.\n\nWhen ToA was released, I could complete it from day #1, first attempt, and while an amazing raid, I didn't feel special. This is fine, not every content has to be like ToB, but I am worried that we probably never will have content like ToB again.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/10873a9\/i_miss_the_time_jagex_was_brave_enough_to_make\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/10873a9\/i_miss_the_time_jagex_was_brave_enough_to_make\/","created_at_timestamp":"2023-01-10 06:00 AM","created_at_date":"2023-01-10"},{"title":"Banned 5 years after the offence????","content":"[removed]","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108nz86\/banned_5_years_after_the_offence\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108nz86\/banned_5_years_after_the_offence\/","created_at_timestamp":"2023-01-10 06:00 PM","created_at_date":"2023-01-10"},{"title":"Is this the best drip in the game ?","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108o5hf\/is_this_the_best_drip_in_the_game\/","url":"https:\/\/i.redd.it\/1mdm2enm9cba1.png","created_at_timestamp":"2023-01-10 06:07 PM","created_at_date":"2023-01-10"},{"title":"Most intrusive pet drop in the game for sure, plae Jagex revert the cat changes","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108o5yc\/most_intrusive_pet_drop_in_the_game_for_sure_plae\/","url":"https:\/\/i.redd.it\/zjkc3kup9cba1.jpg","created_at_timestamp":"2023-01-10 06:07 PM","created_at_date":"2023-01-10"},{"title":"need pvm clan","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108o6mh\/need_pvm_clan\/","url":"https:\/\/i.redd.it\/yglvlafu9cba1.jpg","created_at_timestamp":"2023-01-10 06:08 PM","created_at_date":"2023-01-10"},{"title":"YES WE GET TO GATHER LEAVES YES","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/10879lz\/yes_we_get_to_gather_leaves_yes\/","url":"https:\/\/youtu.be\/bBve2XapjgQ","created_at_timestamp":"2023-01-10 06:10 AM","created_at_date":"2023-01-10"},{"title":"Homie of mine got a new tattoo","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108o9i4\/homie_of_mine_got_a_new_tattoo\/","url":"https:\/\/i.redd.it\/h78ce2pnsaba1.png","created_at_timestamp":"2023-01-10 06:11 PM","created_at_date":"2023-01-10"},{"title":"Logged back in and was in the wilderness?","content":"Hi all,\nI created a new account about a week ago. I will admit that the password was one that I’d used in the past. Today, when I logged into my account, I was in the middle of the wilderness. Nothing was taken, but I was moved without my doing. When I logged out last night, I was cutting willows at Draynor. How could this happen? Was my account logged into without my knowing? I changed the password and email immediately.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108obio\/logged_back_in_and_was_in_the_wilderness\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108obio\/logged_back_in_and_was_in_the_wilderness\/","created_at_timestamp":"2023-01-10 06:13 PM","created_at_date":"2023-01-10"},{"title":"Gear Question","content":"Sorry as I’m sure this is a nobody question but I’ve been away from the game for quite sometime and am not sure what gear I should be prioritizing. In general, is the bowfa (corrupted) a more important item to have than an ancestral set?","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108oc0u\/gear_question\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108oc0u\/gear_question\/","created_at_timestamp":"2023-01-10 06:14 PM","created_at_date":"2023-01-10"},{"title":"OldSchool Runescape but its Blender PT3","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108oi22\/oldschool_runescape_but_its_blender_pt3\/","url":"https:\/\/www.reddit.com\/gallery\/108oi22","created_at_timestamp":"2023-01-10 06:20 PM","created_at_date":"2023-01-10"},{"title":"Quest - Temple of Ikov","content":"[removed]","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1087h0l\/quest_temple_of_ikov\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/1087h0l\/quest_temple_of_ikov\/","created_at_timestamp":"2023-01-10 06:22 AM","created_at_date":"2023-01-10"},{"title":"thought my rng was too crazy not too share","content":"&amp;#x200B;\n\nhttps:\/\/preview.redd.it\/0xyzo4gcvaba1.png?width=518&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=b5aae35c615c42af5837978741c4fd3e2b7fdaf7","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108omb8\/thought_my_rng_was_too_crazy_not_too_share\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108omb8\/thought_my_rng_was_too_crazy_not_too_share\/","created_at_timestamp":"2023-01-10 06:25 PM","created_at_date":"2023-01-10"},{"title":"yo fuck sheep hearder. that shits aids","content":"it's all in the title","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108oqsn\/yo_fuck_sheep_hearder_that_shits_aids\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108oqsn\/yo_fuck_sheep_hearder_that_shits_aids\/","created_at_timestamp":"2023-01-10 06:30 PM","created_at_date":"2023-01-10"},{"title":"Runelite makes pickpocketing extremely addictive","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1087niv\/runelite_makes_pickpocketing_extremely_addictive\/","url":"https:\/\/i.redd.it\/bxwd0sddb7ba1.png","created_at_timestamp":"2023-01-10 06:33 AM","created_at_date":"2023-01-10"},{"title":"The Rainbow Scarf Is Very Cute &lt;3","content":"I am new to RuneScape and I absolutely love the rainbow scarf, it is one of the cutest accessories! I wish it wasn’t just cosmetic though because I can’t wear it all the time because I need to wear other amulets! Absolutely love the representation (*ᴗ͈ˬᴗ͈)ꕤ 🌈🧣","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1087snb\/the_rainbow_scarf_is_very_cute_3\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/1087snb\/the_rainbow_scarf_is_very_cute_3\/","created_at_timestamp":"2023-01-10 06:41 AM","created_at_date":"2023-01-10"},{"title":"Is there an idle notifier plugin that will alert again if you miss the first alert?","content":"Just curious. I usually miss the first one and then come back minutes later to see I've been idle the whole time.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108p17f\/is_there_an_idle_notifier_plugin_that_will_alert\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108p17f\/is_there_an_idle_notifier_plugin_that_will_alert\/","created_at_timestamp":"2023-01-10 06:42 PM","created_at_date":"2023-01-10"},{"title":"Am I doing something wrong? Where's my brittle key?","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108p7y4\/am_i_doing_something_wrong_wheres_my_brittle_key\/","url":"https:\/\/i.redd.it\/ea9yblfmzaba1.png","created_at_timestamp":"2023-01-10 06:49 PM","created_at_date":"2023-01-10"},{"title":"This guy is obsessed with watching me farm. Every Damn Run.","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108821u\/this_guy_is_obsessed_with_watching_me_farm_every\/","url":"https:\/\/i.redd.it\/gt4rq2ikg7ba1.jpg","created_at_timestamp":"2023-01-10 06:57 AM","created_at_date":"2023-01-10"},{"title":"Woot woot","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108pi3j\/woot_woot\/","url":"https:\/\/i.redd.it\/tw1ntja6jcba1.jpg","created_at_timestamp":"2023-01-10 07:00 PM","created_at_date":"2023-01-10"},{"title":"Have a question about the game or the subreddit? Ask away!","content":"# Welcome to the daily \/r\/2007scape question thread!\n\nYou can ask anything about Old School RuneScape here. They are designated for you to ask anything you like that is relevant to the game or this subreddit. Remain respectful to your fellow 'scapers when answering questions; there are stupid questions, but it does not mean you should not be respectful whilst answering them.\n\nKeep in mind that this is not a developer Q&amp;A thread - questions for the game developers should be posted in the weekly developer Q&amp;A posts.\n\nClick [here](https:\/\/reddit.com\/r\/2007scape\/search?q=author%3AAutoModerator&amp;restrict_sr=on&amp;sort=new&amp;feature=legacy_search) to view the archive of \/r\/2007scape \"ask anything\" threads.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108phhf\/have_a_question_about_the_game_or_the_subreddit\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108phhf\/have_a_question_about_the_game_or_the_subreddit\/","created_at_timestamp":"2023-01-10 07:00 PM","created_at_date":"2023-01-10"},{"title":"Tears of Guthix BBBGGG w314 10 Jan 2023","content":"[removed]","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/10885fs\/tears_of_guthix_bbbggg_w314_10_jan_2023\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/10885fs\/tears_of_guthix_bbbggg_w314_10_jan_2023\/","created_at_timestamp":"2023-01-10 07:01 AM","created_at_date":"2023-01-10"},{"title":"Is there anything more convenient than the ardy cape?","content":"I just finished Dragon Slayer II for the first time and was absolutely hyped to finally get  the mythical cape which was my goal and the reason why I grinded hard to complete that quest. The thing is, I just realized that it's pretty cool to have a free bank teleport, but the spirit tree feels like about the same distance as the ardy cloak one and the myth cape is missing a fairy circle in it's vicinity. I was pretty happy to finally have something different than my trusty ardy cape after 600 hours but it seems like you can't beat the convenience of having a spirit tree and a fairy circle in a close vicinity to one another. Are there any upgrades to that sans the construction cape and a maxed out POH?\n\nAnd while I'm on that topic, what is the fastest way to your POH sans having the 99 cape? I'm currently using Xerics and its worling ok. Are there better options?","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/10885ff\/is_there_anything_more_convenient_than_the_ardy\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/10885ff\/is_there_anything_more_convenient_than_the_ardy\/","created_at_timestamp":"2023-01-10 07:01 AM","created_at_date":"2023-01-10"},{"title":"My take on the Bard skill","content":"Barding\/music\/whatever would work for the skill name\n\n&amp;#x200B;\n\nI would like to preface this with the fact that I wrote this before reading any of the other barding suggestions so apologies if everything overlaps or if it's just bad.\n\nSo here's the concept.\n\nAdd a bunch of different instruments to the game. examples could be: banjo, harp, flute, drum, bongo\n\nAs you level up the skill, you unlock different instruments and different sheet music.\n\nThe main benefit to the game would be for buffing your character in different ways.\n\nCurrently, my idea is to have different instruments be used for different types of buffs. \n\nSome examples could be:\n\n\\- Flute: Group non skill buffs (i.e. reduced run energy drain rate or increased potion duration)\n\n\\- Bongos: Group combat buffs (i.e. increase max hit by 1 or reduced prayer drain or increase a specific stat by 1 like attack)\n\n\\- Harp: Solo skilling buffs (i.e. boost a random skill by 1)\n\n&amp;#x200B;\n\nThese are just examples that I thought of, Jagex would of course think of their own buffs and instruments.\n\n&amp;#x200B;\n\nIn order to use these, the player will need to equip the instrument and use a specific music sheet. \n\nThe player would gain XP for creating the music sheet and for playing it. \n\nThe main training method for this would be to actually create the music sheets. This could be done with specific skills in mind.\n\nI haven't decided on what the best way to create these music sheets would be. \n\nOne idea I had was writing it on papyrus, then enchanting it using magic or something like that. That way it could scale with magic level.\n\nAnother way could be to have some sort of item requirement that gets consumed when creating the music sheet (i.e. energy potion for a low level run drain rate reduction song). I'm personally leaning towards this one.\n\nThe music sheets would be tradable. That way it creates incentive for people to make them as it could make them some gp and the players who can't be bothered can just buy the sheet music.\n\n&amp;#x200B;\n\nOne other thought I had that could be an issue is getting the duration of the buffs correct. Too long and it will be too powerful and too short would be useless. I think the best way would be to have them differ from different sheets of music. Higher leveled music could either have a longer duration or a more powerful buff. \n\n&amp;#x200B;\n\nThere would need to be restrictions on how many buffs can be added at once otherwise it would be too overpowered. My thoughts were to have a maximum of 1 active buff for group and 1 for solo instruments. (Although this would need a lot more thought)\n\n&amp;#x200B;\n\nOn top of this, there could be a music hall added somewhere in the game where you can use the instruments you've unlocked to create your own music.\n\nThe songs could then be submitted to a local playlist and all players inside the music hall could hear it. It won't grant xp but it could make a bit of a song creating community.\n\nYou could also have the option to play these at the Falador party room.\n\n&amp;#x200B;\n\nThat's pretty much my idea at its current stage. Let me know what you think!","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1088ba6\/my_take_on_the_bard_skill\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/1088ba6\/my_take_on_the_bard_skill\/","created_at_timestamp":"2023-01-10 07:10 AM","created_at_date":"2023-01-10"},{"title":"Tiger King Fans, I Present To You Carol…..","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1088ut0\/tiger_king_fans_i_present_to_you_carol\/","url":"https:\/\/i.redd.it\/ye2eipio59ba1.jpg","created_at_timestamp":"2023-01-10 07:39 AM","created_at_date":"2023-01-10"},{"title":"Best Programming Languages For Hacking In 2023","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/10896n5\/best_programming_languages_for_hacking_in_2023\/","url":"https:\/\/www.arfasoftech.com\/blog\/Best-Programming-Languages-For-Hacking-In-2023","created_at_timestamp":"2023-01-10 07:57 AM","created_at_date":"2023-01-10"},{"title":"Is this a joke 😂","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108986v\/is_this_a_joke\/","url":"https:\/\/youtu.be\/1QzVQafsdsg","created_at_timestamp":"2023-01-10 07:59 AM","created_at_date":"2023-01-10"},{"title":"PSA: Due to the account recovery system, if you have made past security mistakes such as reusing passwords, your account can be compromised and there’s nothing you can do about it.","content":"The biggest flaw with Jagex account security is that once you’ve made an account security mistake, even if it was years ago as a kid, there’s nothing you can do to resecure your account, since you can’t lock the recovery process, you can’t change the login ID, you can’t request hardware recovery tokens, or save a unique recovery code. \n\nIf you have reused passwords associated with your login, all it takes is those databases being leaked, which contain your login ID, old password, and IP, which can be enough to recover your account due to how much Jagex account recovery values very old passwords. This is how old, actively played accounts are recovered through 2FA, since recovery bypasses all 2FA. \n\nThe only way to secure your account is create a new account on a new email which is only ever used for that login, change the recovery email, delete the original one, and then set up the 2FA. \n\nUnfortunately if you’ve ever reused your login ID passwords in other places, all you can do is hope the services you used them on never have a database leak. This also goes for if you’ve ever been phished, RATed, otherwise hacked, overshared irl information, or shared accounts. \n\nIf you’ve never committed an account security mistake, congratulations, but everyone who hasn’t needs to be demanding a more robust recovery process so they can at least retroactively secure their account.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/10898tk\/psa_due_to_the_account_recovery_system_if_you\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/10898tk\/psa_due_to_the_account_recovery_system_if_you\/","created_at_timestamp":"2023-01-10 08:00 AM","created_at_date":"2023-01-10"},{"title":"Finally got lvl 100 in all skills","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1089hab\/finally_got_lvl_100_in_all_skills\/","url":"https:\/\/i.redd.it\/yn93pnubb9ba1.jpg","created_at_timestamp":"2023-01-10 08:11 AM","created_at_date":"2023-01-10"},{"title":"Pharaohs Scepter Rate?","content":"Have they repaired the issue where the gold sarcophagus is less likely to give a scepter the higher the room number? Seems like a pretty quick fix to just change mummy spawn rates as the rooms progress.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1089qvv\/pharaohs_scepter_rate\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/1089qvv\/pharaohs_scepter_rate\/","created_at_timestamp":"2023-01-10 08:24 AM","created_at_date":"2023-01-10"},{"title":"Let me draw for you guys again! 😊","content":"I want to draw your guys fav OSRS NPC again 🎨\nWhat would you guys like to see?\n\n[View Poll](https:\/\/www.reddit.com\/poll\/108a2om)","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108a2om\/let_me_draw_for_you_guys_again\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108a2om\/let_me_draw_for_you_guys_again\/","created_at_timestamp":"2023-01-10 08:39 AM","created_at_date":"2023-01-10"},{"title":"Account hacked, and banned for RWT. Any chance of appeal?","content":"[removed]","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108a6hq\/account_hacked_and_banned_for_rwt_any_chance_of\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108a6hq\/account_hacked_and_banned_for_rwt_any_chance_of\/","created_at_timestamp":"2023-01-10 08:44 AM","created_at_date":"2023-01-10"},{"title":"no wildy rework required","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108ac1y\/no_wildy_rework_required\/","url":"https:\/\/www.reddit.com\/gallery\/108ac1y","created_at_timestamp":"2023-01-10 08:52 AM","created_at_date":"2023-01-10"},{"title":"Will the new bow be on par with the bofa? I heard the bofa fell by around 50-100m due to the web weaver coming out tomorrow","content":"I hesrd its going to make cg less of an essential grind","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108aeff\/will_the_new_bow_be_on_par_with_the_bofa_i_heard\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108aeff\/will_the_new_bow_be_on_par_with_the_bofa_i_heard\/","created_at_timestamp":"2023-01-10 08:55 AM","created_at_date":"2023-01-10"},{"title":"First purple at ToA, 170 invocation 15kc","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108aelo\/first_purple_at_toa_170_invocation_15kc\/","url":"https:\/\/i.redd.it\/w0g0pz9c18ba1.png","created_at_timestamp":"2023-01-10 08:55 AM","created_at_date":"2023-01-10"},{"title":"Ancient Staff Ornament Kits","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108aj4b\/ancient_staff_ornament_kits\/","url":"https:\/\/i.redd.it\/rgvheiel28ba1.png","created_at_timestamp":"2023-01-10 09:00 AM","created_at_date":"2023-01-10"},{"title":"Can I start complaining?","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108ak9l\/can_i_start_complaining\/","url":"https:\/\/i.redd.it\/3xu7nv4fk9ba1.jpg","created_at_timestamp":"2023-01-10 09:02 AM","created_at_date":"2023-01-10"},{"title":"Let's make a thread about helpful tips some people probably don't know","content":"Timesaving, money-saving, or anything!\n\nI'll start with\n\n* You can note your farmed produce (e.g. herbs, papayas, etc.) by using it on a leprechaun\n* You can make payments for your plants using noted items\n* You can equip\/eat\/drink items in your inventory while the bank interface is open (withdraw potion, drink sip, deposit, all without closing bank)","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108aonq\/lets_make_a_thread_about_helpful_tips_some_people\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108aonq\/lets_make_a_thread_about_helpful_tips_some_people\/","created_at_timestamp":"2023-01-10 09:07 AM","created_at_date":"2023-01-10"},{"title":"1k Kraken kc, I'm loving this task!","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108ap7u\/1k_kraken_kc_im_loving_this_task\/","url":"https:\/\/i.redd.it\/jv4f93zy38ba1.png","created_at_timestamp":"2023-01-10 09:08 AM","created_at_date":"2023-01-10"},{"title":"OSRS Youtuber Tier List","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108b34g\/osrs_youtuber_tier_list\/","url":"https:\/\/youtu.be\/pgRoKJkYWao","created_at_timestamp":"2023-01-10 09:25 AM","created_at_date":"2023-01-10"},{"title":"Price of blue party hat?","content":"whats the price of a blue party hat? and where can I sell one?","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108bb1c\/price_of_blue_party_hat\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108bb1c\/price_of_blue_party_hat\/","created_at_timestamp":"2023-01-10 09:35 AM","created_at_date":"2023-01-10"},{"title":"Hello everyone just one simple question.","content":"Does xp scale past 99? Or does xp rates stay the same?","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108bcmq\/hello_everyone_just_one_simple_question\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108bcmq\/hello_everyone_just_one_simple_question\/","created_at_timestamp":"2023-01-10 09:37 AM","created_at_date":"2023-01-10"},{"title":"Looking for a clan","content":"I’m in need of a clan so it doesn’t get boring by myself I’ve logged a considerable amount of time into my account but still working on my stats and quests so if your interested\/willing to invite please message me","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108bi5s\/looking_for_a_clan\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108bi5s\/looking_for_a_clan\/","created_at_timestamp":"2023-01-10 09:44 AM","created_at_date":"2023-01-10"},{"title":"Vork question","content":"I’m 92 ranged, 80’s in melee stats. 70 prayer. Elite void and salve (ei) with archers ring (i). I have BGS and rcb with ruby bolts (e) and diamond bolts (e) for after 50% Hp. I just feel like the BGS is not making a huge difference in my kills per hour. \n\nShould I keep it how it is or get rid of my BGS and buy an Armadyl crossbow? I also have TBP, i havent tried that since getting the BGS. I am hoping to get visage drop, otherwise I’ll just buy one and add to my antidrag shield. \n\nReally hoping to use Vork to make money to fund training so I can get into raids and be efficient at them. And i know arma cbow is good for other bosses\/raids so maybe it’s worth it to buy that now?","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108btk6\/vork_question\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108btk6\/vork_question\/","created_at_timestamp":"2023-01-10 09:58 AM","created_at_date":"2023-01-10"},{"title":"Is my account safe ?","content":"I got hacked yesterday and lost about 15 to 20m, i know its not much but its cleaned me out. I have changed my password and set up a new authenticator but I'm just hesitant to touch the account again","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108bw34\/is_my_account_safe\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108bw34\/is_my_account_safe\/","created_at_timestamp":"2023-01-10 10:00 AM","created_at_date":"2023-01-10"},{"title":"Big POH Layouts","content":"Are there any big POH layouts that include all the rooms in an efficient way? I've watched so many POH tutorial videos but found none. I want my POH to be big and also efficient.\n\n&amp;#x200B;\n\nAny opinions or example layouts?","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108bv0e\/big_poh_layouts\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108bv0e\/big_poh_layouts\/","created_at_timestamp":"2023-01-10 10:00 AM","created_at_date":"2023-01-10"},{"title":"Game is unplayable 🦀🦀","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108bwrg\/game_is_unplayable\/","url":"https:\/\/i.imgur.com\/NHIABzt.jpg","created_at_timestamp":"2023-01-10 10:01 AM","created_at_date":"2023-01-10"},{"title":"Newbie’s thoughts after 1st Corrupted Gauntlet KC","content":"I just wanted to give a few thoughts after my first CG kc. I am no expert, of course, but wanted to give a few thoughts that I found helpful that were not in many of the online guides.\n\nIt took 29 attempts, with 20 of those on mobile, to get my first kc. The closest I got on mobile (phone) was 55 hp remaining on Hunlef. I figured out after a few normal gauntlets that were all t2 prep that t2 would not save me much more than t1 from missing prayer swaps or tornado stacks.\n\nI ended up going with t1 prep, two t3 weapons, and 24 fish. I only ran out of food once. Every other time I was stacked out, usually by tornados or back-to-back missed prayers.\n\nLessons learned (keeping these short for brevity’s sake):\n\nMy main action priority: Dodge tornado &gt; prayer swap &gt; floor dodging &gt; eating &gt; attacking\/weapon switching.\n\nEating should be left to tornado phase, if possible. Eating directly after your character begins to run, not when he is arriving at the tile you clicked.\n\nAlways count to 4 for Hunlef attacks and switch after the 4th projectile appears. The attack damage seems to be calculated the first frame of Hunlef’s attack animation, so if you switch during the animation, but before the projectile appears, you will still take damage.\n\nLearn tornado dodge timing (running through tornados). In the last phase it is often necessary to run through a tornado to path off the floor in time.\n\nLeave the prayer screen open by default. Switch back to prayer screen as soon as eating\/weapon switch is done.\n\n***Practice using peripheral vision to track hunlef’s attack switches and character pathing. Eyes should rest somewhere between the character and Hunlef. During the final phase, many things happen at once. Being able to intake information using peripheral vision helps not miss prayer switches while dodging tornados, especially if you forget the attack count.\n\nThere’s my $0.02. I hope it helps, and if you think I should change anything to improve, let me know!","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108bzw4\/newbies_thoughts_after_1st_corrupted_gauntlet_kc\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108bzw4\/newbies_thoughts_after_1st_corrupted_gauntlet_kc\/","created_at_timestamp":"2023-01-10 10:05 AM","created_at_date":"2023-01-10"},{"title":"Finally committed to first demonics trip n it paid off","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108c3au\/finally_committed_to_first_demonics_trip_n_it\/","url":"https:\/\/i.redd.it\/mij9kffgw9ba1.jpg","created_at_timestamp":"2023-01-10 10:09 AM","created_at_date":"2023-01-10"},{"title":"Most toxic game by far go pvm in Wildy and see what I mean","content":"This game is full of toxic trolls that can’t pk they should just take it out of the game","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108c7bq\/most_toxic_game_by_far_go_pvm_in_wildy_and_see\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108c7bq\/most_toxic_game_by_far_go_pvm_in_wildy_and_see\/","created_at_timestamp":"2023-01-10 10:14 AM","created_at_date":"2023-01-10"},{"title":"Account Recovery Opt-Out","content":"Let me opt-out of Account Recovery on my account and only be able to recover\/reset if I maintain access to the original email.\n\nIf you share your information after opting out and you get locked out from that person changing your login information, that's 100% on you. Same logic as permanent bank\/login PINs - you forget that's on you.\n\n&amp;#x200B;\n\nIt doesn't matter if you're an iron, main, pvper, or skiller - **Losing all your stuff is enough of a punishment.** Never being able to use your account again without the risk of getting recovered again is how you get people to quit.\n\nWay too many people are getting recovered because of database breaches and not knowing to use a new email to make an account because no other website\/game provider has this issue.\n\nDatabase breaches happen and it doesn't make sense to let accounts be compromised permanently. It's ridiculous that discussing something as benign as what you're interested in or where you roughly live can potentially compromise your account when we're in a MMO.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108cc6n\/account_recovery_optout\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108cc6n\/account_recovery_optout\/","created_at_timestamp":"2023-01-10 10:20 AM","created_at_date":"2023-01-10"},{"title":"Finally got the TOA pet, even with a death","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108ces6\/finally_got_the_toa_pet_even_with_a_death\/","url":"https:\/\/i.redd.it\/al99i29uy9ba1.jpg","created_at_timestamp":"2023-01-10 10:22 AM","created_at_date":"2023-01-10"},{"title":"What to do after getting hacked","content":"[removed]","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108cgi2\/what_to_do_after_getting_hacked\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108cgi2\/what_to_do_after_getting_hacked\/","created_at_timestamp":"2023-01-10 10:25 AM","created_at_date":"2023-01-10"},{"title":"I only wanted a set of Dharok…","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108clig\/i_only_wanted_a_set_of_dharok\/","url":"https:\/\/i.redd.it\/iz8mdqlpi8ba1.jpg","created_at_timestamp":"2023-01-10 10:30 AM","created_at_date":"2023-01-10"},{"title":"Dear jagex","content":"Can you please change the bank pin recovery system so we can make it take years for hackers  to get anything off of our accounts.\nYou obviously have no plans to make the actual account recovery system better but what you could do is let us chose how many days you'd have to wait to remove the bank pin.\nI know that anyone with half a brain won't forget their own bank pin and if that does happen it'll create some temporary UIM.\nI for one want to set my bank pin removal time to 10 years or more even.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108cqnq\/dear_jagex\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108cqnq\/dear_jagex\/","created_at_timestamp":"2023-01-10 10:36 AM","created_at_date":"2023-01-10"},{"title":"Huge botting problem in rev caves","content":"As no surprise to anyone, the rev caves are full of bots. Mostly 60s-80s. \n\nSo me being me I hopped on my baby pure to do some damage… \n\nLet me tell you know annoying these bits are. If you don’t 1 tick switch to your weapon. You won’t be hitting them off prayer. \n\nI tested it. I froze a bot. Stood under him, and just swapped my weapons around. To no surprise, it was perfectly swapping prayers to what weapon I was using. Crazy huh\n\nAnyways if you want to kill them, just keep a bow or melee weapon in your hand and just mage them.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108cun2\/huge_botting_problem_in_rev_caves\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108cun2\/huge_botting_problem_in_rev_caves\/","created_at_timestamp":"2023-01-10 10:41 AM","created_at_date":"2023-01-10"},{"title":"Replace monkey puzzle room with inferno waves","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108cw76\/replace_monkey_puzzle_room_with_inferno_waves\/","url":"https:\/\/i.redd.it\/g3l7ekavk8ba1.png","created_at_timestamp":"2023-01-10 10:43 AM","created_at_date":"2023-01-10"},{"title":"[Suggestion] A Nechryael Boss","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108cy78\/suggestion_a_nechryael_boss\/","url":"https:\/\/i.redd.it\/8dd0wytvk8ba1.png","created_at_timestamp":"2023-01-10 10:45 AM","created_at_date":"2023-01-10"},{"title":"Skill Suggestion: Dueling","content":"What if the new skill was Dueling?\n\nPlayers would receive exp for fighting other players. In order to incentivize players into the wilderness, bonus experience could be granted based on how much the gear you bring is worth and also how deep in the wilderness you are. \n\nHCIM could use the Duel Arena which would be a safe death and train that way. \n\nI haven’t thought out what the skill would do, maybe give bonuses to damage. Like you learn how to fight better? I picture it like Slayer except with people instead of creatures.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108cy9u\/skill_suggestion_dueling\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108cy9u\/skill_suggestion_dueling\/","created_at_timestamp":"2023-01-10 10:45 AM","created_at_date":"2023-01-10"},{"title":"For those who bitch about pkers on this sub and have never pked, this is for you.","content":"If you're doing deep wildy content then just bring a Dinh's Bulwark and you'll never die. I have no fucking clue why Jagex would add this pile of shit to the game but since they did, why not abuse it? You cannot die with this item equipped unless you're an idiot so please feel free to exploit the most broken item in the game.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108czj4\/for_those_who_bitch_about_pkers_on_this_sub_and\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108czj4\/for_those_who_bitch_about_pkers_on_this_sub_and\/","created_at_timestamp":"2023-01-10 10:47 AM","created_at_date":"2023-01-10"},{"title":"[Suggestion] Nechryadnezzar, Emperor of the Nechryaels","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108d2c1\/suggestion_nechryadnezzar_emperor_of_the\/","url":"https:\/\/i.redd.it\/3s8kqsb6m8ba1.png","created_at_timestamp":"2023-01-10 10:50 AM","created_at_date":"2023-01-10"},{"title":"First time doing Zulrah","content":"[deleted]","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108d3ge\/first_time_doing_zulrah\/","url":"","created_at_timestamp":"2023-01-10 10:51 AM","created_at_date":"2023-01-10"},{"title":"Rune Pouch disappeared?","content":"I'm super confused, I'm afk'ing vyres here and I go to alch some stuff but my rune pouch is gone from my inventory. I figure I must have banked it by accident. Nope, not in my bank either. I know it's not alchable, so where the fuck did it disappear to? Has this ever happened anyone else?","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108d2nb\/rune_pouch_disappeared\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108d2nb\/rune_pouch_disappeared\/","created_at_timestamp":"2023-01-10 10:51 AM","created_at_date":"2023-01-10"},{"title":"Which one of you did this","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108d48g\/which_one_of_you_did_this\/","url":"https:\/\/i.redd.it\/f8ul1gb64aba1.jpg","created_at_timestamp":"2023-01-10 10:52 AM","created_at_date":"2023-01-10"},{"title":"🦀 🦀 🦀","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108d4gm\/_\/","url":"https:\/\/i.redd.it\/w6bs6vx74aba1.jpg","created_at_timestamp":"2023-01-10 10:53 AM","created_at_date":"2023-01-10"},{"title":"First time doing Zulrah!","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108d679\/first_time_doing_zulrah\/","url":"https:\/\/www.reddit.com\/gallery\/108d679","created_at_timestamp":"2023-01-10 10:55 AM","created_at_date":"2023-01-10"},{"title":"50.000 Middleman convincing me to buy it to 5x my investment, don’t fall for this please.","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108d8gw\/50000_middleman_convincing_me_to_buy_it_to_5x_my\/","url":"https:\/\/www.reddit.com\/gallery\/108d8gw","created_at_timestamp":"2023-01-10 10:57 AM","created_at_date":"2023-01-10"},{"title":"Does anyone else not enjoy the direction OSRS went with their end game?","content":"I noticed i got in a bit of a pattern when it comes to OSRS. I make an account, really enjoy it for a while and then abandon it. This is often at the 2000-2100 total mark. I was kind of curious how you guys are dealing with this. \n\nWhen OSRS released i had a bunch of goals. The thing that really motivated me was that these goals were reachable. I knew that i could do end-game PvM eventually. When GWD was released i also knew that if i grinded it, i could obtain the drops. Even if i went dry, it was all in reach. I really enjoyed OSRS. \n\nNow, almost 10 years later, i am just demotivated. I have 3 accounts. A main, an iron, a Hardcore iron. Each of these accounts is over 2k total with the highest being just over 2100. I sometimes AFK the iron while i work but that's about it. \n\nThe reason for this demotivation is that the game became centered around \"full-time players\". OSRS isn't a game anymore, it's a job. If you don't put in at least 60-80 hours a week you are never ever going to \"complete\" this game. I'm not even talking about maxing but about PvM. \n\nThey put in grinds like the Wyvern Sigil, Dragon Warhammer, Basilisk Jaw which were rare enough but still manageable i suppose. Then we got stuff like the Corp sigils, Nightmare, Raids. It just got so insanely rare to receive a drop in your name it demotivated me hard. As a reference a bowfa alone takes about 80-100 hours if you go on drop rate. That's an insane amount of time for just 1 item in a video game. \n\nI put in the work. My Iron even has some raids items, the Dragon Warhammer, Jaw and more. I just got so demotivated knowing i will never be able to get this account to where i want it to be. Everything just got way too rare. I don't have this amount of time. Even if i did, the drops are so rare it's just not fun anymore. Completing the Nightmare, Nex or any Raid is literal torture. \n\nAlso to add: I'm not saying items should not be rare. I just feel like we went from rare to absolutely mental and i have no idea why. \n\nDoes anyone else share this feeling? How do you deal with it? I am really searching for my Runescape spark i've had for so many years.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108dui1\/does_anyone_else_not_enjoy_the_direction_osrs\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108dui1\/does_anyone_else_not_enjoy_the_direction_osrs\/","created_at_timestamp":"2023-01-10 11:22 AM","created_at_date":"2023-01-10"},{"title":"I’ve tried to leave my gim twice and both times waited for the 7 days and nothings happened, please help!!","content":"please","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108dz2m\/ive_tried_to_leave_my_gim_twice_and_both_times\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108dz2m\/ive_tried_to_leave_my_gim_twice_and_both_times\/","created_at_timestamp":"2023-01-10 11:27 AM","created_at_date":"2023-01-10"},{"title":"New Skill Proposal: Inscription (Audio Narration and TL;DR in comments.)","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108e0wj\/new_skill_proposal_inscription_audio_narration\/","url":"https:\/\/www.reddit.com\/gallery\/108e0wj","created_at_timestamp":"2023-01-10 11:30 AM","created_at_date":"2023-01-10"},{"title":"My RNG has been high in the worst way..","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108e44y\/my_rng_has_been_high_in_the_worst_way\/","url":"https:\/\/i.redd.it\/l4u0mbavs8ba1.png","created_at_timestamp":"2023-01-10 11:33 AM","created_at_date":"2023-01-10"},{"title":"Theatre of Blood Strategy Iceberg (Explanation in Comments)","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108ebeh\/theatre_of_blood_strategy_iceberg_explanation_in\/","url":"https:\/\/i.redd.it\/f1vzokwbv8ba1.png","created_at_timestamp":"2023-01-10 11:42 AM","created_at_date":"2023-01-10"},{"title":"Unpopular Opinion: If you get hacked, then it's on you (Excluding Mod Jed Situation)","content":"[removed]","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108ef0l\/unpopular_opinion_if_you_get_hacked_then_its_on\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108ef0l\/unpopular_opinion_if_you_get_hacked_then_its_on\/","created_at_timestamp":"2023-01-10 11:46 AM","created_at_date":"2023-01-10"},{"title":"Looking for a clan","content":"Hey everyone, I'm currently looking for a clan. I have never been in one and would like to live the experience. I would love to learn some raids and do some bossing with other people. I'm always soloing and would like some company.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108ehin\/looking_for_a_clan\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108ehin\/looking_for_a_clan\/","created_at_timestamp":"2023-01-10 11:49 AM","created_at_date":"2023-01-10"},{"title":"J-Mod response needed. URGENT","content":"For starters , I'm kind of an idiot. I got a new laptop and set it up for runelite . Googled \"runelite\" and clicked the first one which I now realize says \"AD\" before it. Entered in all my info . Got a request for email change and thought okay maybe I'm supposed to change my email every so often. I've had this account since 2014. Clicked the link &amp; lost full access to my account. I get it , I'm dumb basically got lured or my armor trimmed . It happens to the best of us \n\nBut what's not okay , is filling out the entire form for an account recovery will all payment info \/ first passwords \/ emails \/ conformation membership numbers etc and getting a response 4 days later from jagex support telling me to \n\n\"Hey just reset your password and it will send an email to your registered email \" \n\nLike the email recovery form I filled out was to regain access to a stolen account . To hopefully get the account locked or something before they steal everything or bot the account or whatever it is. \n\nI just wish they had something other than an automated basic bot response and could actually help out players when they literally give every piece of info to their account . \n\nHoping this does something because I'm all out of options .","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108ehtx\/jmod_response_needed_urgent\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108ehtx\/jmod_response_needed_urgent\/","created_at_timestamp":"2023-01-10 11:49 AM","created_at_date":"2023-01-10"},{"title":"No XP waste","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108ekzb\/no_xp_waste\/","url":"https:\/\/v.redd.it\/r7rx1ihcx8ba1","created_at_timestamp":"2023-01-10 11:52 AM","created_at_date":"2023-01-10"},{"title":"New Skill Proposal: Inscription (Audio Narration and TL;DR in comments.)","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108eol8\/new_skill_proposal_inscription_audio_narration\/","url":"https:\/\/www.reddit.com\/gallery\/108eol8","created_at_timestamp":"2023-01-10 11:57 AM","created_at_date":"2023-01-10"},{"title":"I decided to turn my Vorkath design into a mousepad 🐲","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108eral\/i_decided_to_turn_my_vorkath_design_into_a\/","url":"https:\/\/v.redd.it\/e0k6dj9ny8ba1","created_at_timestamp":"2023-01-10 12:00 PM","created_at_date":"2023-01-10"},{"title":"Are Ammonite Crabs getting too competitive?","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108evpg\/are_ammonite_crabs_getting_too_competitive\/","url":"https:\/\/i.redd.it\/a1gtpfv9z8ba1.png","created_at_timestamp":"2023-01-10 12:04 PM","created_at_date":"2023-01-10"},{"title":"Never played during a quest release before","content":"I plan on trying Secrets of the North on release, and was just curious about a few things:\n\nWhat is the day 1 new quest experience like? \n\nDoes the quest usually get solved quickly? \n\nAre there hordes of people on every world working together to finish it?\n\nSuper excited to do this on release.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108ew1b\/never_played_during_a_quest_release_before\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108ew1b\/never_played_during_a_quest_release_before\/","created_at_timestamp":"2023-01-10 12:05 PM","created_at_date":"2023-01-10"},{"title":"Am I crazy?","content":"For years I have been trying to find an old (2006-7ish) YouTube video that was a RuneScape video made in Halo. I believe it was titled “RuneScape on Halo”. Some highlights of the video include:\n\n1) A master chief wearing a Santa hat saying “selling Santa hat 20 millionnnnn”. A guy says “I’ll buy your Santa hat. How bout 20 mil? Then kills him. The original guy freaks out saying “that guy killed me while I was in FALADOR”\n\n2) Two MCs sword fighting in the “wild”. Before the fight, one of them jumps and does a 360 while the mortal Kombat theme plays. \n\nOne of the creators went by “BbqCereal”\n\nPlease tell me someone else knows what I’m talking about and that I’m not crazy.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1081a2a\/am_i_crazy\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/1081a2a\/am_i_crazy\/","created_at_timestamp":"2023-01-10 12:09 AM","created_at_date":"2023-01-10"},{"title":"Lets fix MTA in a way that doesn't diminish the efforts of those who've already suffered in a very impactful way. Make the Guardian pet a 1\/30,000 chance for every spell cast in the MTA minigames. Reskin to one of the four via pizzaz points","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1081bs6\/lets_fix_mta_in_a_way_that_doesnt_diminish_the\/","url":"https:\/\/i.redd.it\/mgln8jlff5ba1.png","created_at_timestamp":"2023-01-10 12:12 AM","created_at_date":"2023-01-10"},{"title":"New Skill Proposal: Inscription (Audio Version and TL;DR in comments.)","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108f77x\/new_skill_proposal_inscription_audio_version_and\/","url":"https:\/\/www.reddit.com\/gallery\/108f77x","created_at_timestamp":"2023-01-10 12:17 PM","created_at_date":"2023-01-10"},{"title":"Actual XP Rates of Fishing Sacred Eels","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108fclv\/actual_xp_rates_of_fishing_sacred_eels\/","url":"https:\/\/youtu.be\/S_Umiu0Pchc","created_at_timestamp":"2023-01-10 12:22 PM","created_at_date":"2023-01-10"},{"title":"I spent 2 hours last night making sure a bot got close to zero xp at sand crabs","content":"I was training on crabs for the last time (70 att and str finally!) And suddenly a player pops in on a tille adjacent to 2 crabs and this mf starts killing crabs on MY BEACH. I try talking to them, no response.  They do not move from their spot. I was being nice, not taking their 2 crabs (slowing down my rate because I'm hitting 30s on these poor crabs). I started to get suspicious of botting so I setup a timer and saw that they were running away to reset at exact intervals. \n\nFor the rest of my time training there, I made sure to swoop in and 2-shot every crab that spawned next to them as soon as they appeared. They probably got like 50xp for the whole 2 hours I was there.\n\nYou're welcome","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108fecv\/i_spent_2_hours_last_night_making_sure_a_bot_got\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108fecv\/i_spent_2_hours_last_night_making_sure_a_bot_got\/","created_at_timestamp":"2023-01-10 12:24 PM","created_at_date":"2023-01-10"},{"title":"why do you all continue to play a game with the most glaring of security flaws?","content":"seems like if you sneeze you get your account stolen and botted and all of your bank gets jacked. why even invest so much time into something if at any point some random can get into your account and steal your shit?","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108ffjk\/why_do_you_all_continue_to_play_a_game_with_the\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108ffjk\/why_do_you_all_continue_to_play_a_game_with_the\/","created_at_timestamp":"2023-01-10 12:26 PM","created_at_date":"2023-01-10"},{"title":"new boss confirmed to be weak to crush?","content":"a lot of members in solitary and vintage seem to be noting it was confirmed, any1 else have similar information?","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1081n05\/new_boss_confirmed_to_be_weak_to_crush\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/1081n05\/new_boss_confirmed_to_be_weak_to_crush\/","created_at_timestamp":"2023-01-10 12:28 AM","created_at_date":"2023-01-10"},{"title":"Thank god Spria finally taught me how to do slayer..","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108fl9g\/thank_god_spria_finally_taught_me_how_to_do_slayer\/","url":"https:\/\/www.reddit.com\/gallery\/108fl9g","created_at_timestamp":"2023-01-10 12:32 PM","created_at_date":"2023-01-10"},{"title":"quick test (this'll be deleted in a second)","content":"TEST - WILL BE DELETED","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108fmhh\/quick_test_thisll_be_deleted_in_a_second\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108fmhh\/quick_test_thisll_be_deleted_in_a_second\/","created_at_timestamp":"2023-01-10 12:33 PM","created_at_date":"2023-01-10"},{"title":"I was today years old when I learned the dfs has a spec attack lmao","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108fmn8\/i_was_today_years_old_when_i_learned_the_dfs_has\/","url":"https:\/\/i.redd.it\/frmv37h8maba1.gif","created_at_timestamp":"2023-01-10 12:34 PM","created_at_date":"2023-01-10"},{"title":"🤖 There are mort myre fungus bots in every world 🤖","content":"bots getting high on that fungus\n\nplz ban","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1081tq9\/there_are_mort_myre_fungus_bots_in_every_world\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/1081tq9\/there_are_mort_myre_fungus_bots_in_every_world\/","created_at_timestamp":"2023-01-10 12:38 AM","created_at_date":"2023-01-10"},{"title":"They should create a rare slayer drop that can be turned in for a random roll for a random slayer enemy pet.","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108frs6\/they_should_create_a_rare_slayer_drop_that_can_be\/","url":"https:\/\/i.redd.it\/ft00o97j59ba1.jpg","created_at_timestamp":"2023-01-10 12:39 PM","created_at_date":"2023-01-10"},{"title":"Combat 39 Attempting Monkey Madness I","content":"Hello, im a pure with 13defence trying to do monkey madness I,\n\nive come to the point where im to make the amulet from wall of flame,\n\nbut the problem is i cannot get further when im finally down below the staircase from all the monkey guards above (167 combats),\n\nim in need of help here a team oh something,\n\nmight be a rediculous place to ask this but ill try anyway.\n\n&amp;#x200B;\n\nwhat im asking is that someone oh bunch of players block the guards above,\n\nand the smaller monkeys below so i can create the abe amulet on wall of fire.\n\n&amp;#x200B;\n\nim 15prayer and plan to stay so.\n\n&amp;#x200B;\n\ni don't expect this to get any attention but maybe im lucky..","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108fr79\/combat_39_attempting_monkey_madness_i\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108fr79\/combat_39_attempting_monkey_madness_i\/","created_at_timestamp":"2023-01-10 12:39 PM","created_at_date":"2023-01-10"},{"title":"u\/unratedex why you in my DM's saying you like children daycares?","content":"[removed]","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108fvvl\/uunratedex_why_you_in_my_dms_saying_you_like\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108fvvl\/uunratedex_why_you_in_my_dms_saying_you_like\/","created_at_timestamp":"2023-01-10 12:44 PM","created_at_date":"2023-01-10"},{"title":"first ever complete collection log ft. comically low kc","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108fvwa\/first_ever_complete_collection_log_ft_comically\/","url":"https:\/\/i.redd.it\/87ejpto2oaba1.jpg","created_at_timestamp":"2023-01-10 12:44 PM","created_at_date":"2023-01-10"},{"title":"Monkey Madness 1 caves","content":"Hello, I’m half way through monkey madness 1 however i stopped to be able to train chins at monkey skeletons.\n\nI was recently told that i could still go to the spot after completing the quest without getting the defense Exp.\n\nIs that true? Can i travel to the caves after completing the quest without having to get the defense exp?","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1081yha\/monkey_madness_1_caves\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/1081yha\/monkey_madness_1_caves\/","created_at_timestamp":"2023-01-10 12:45 AM","created_at_date":"2023-01-10"},{"title":"Casual EST max player looking for casual CC play on weekends","content":"Looking for a Casual group of people to play with on weekends. Interested in learning Raids and learning other group bosses, or just chill in general. I'm maxed, I also have decent end game gear. I use discord and am in EST time Zone.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/1081y3t\/casual_est_max_player_looking_for_casual_cc_play\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/1081y3t\/casual_est_max_player_looking_for_casual_cc_play\/","created_at_timestamp":"2023-01-10 12:45 AM","created_at_date":"2023-01-10"},{"title":"Uncut Diamond Help?","content":"So I'm doing Fairytales 1 and Maliggy needs an uncut diamond.\n\nI at this point have yet to come across one.\n\nI just did six hours of Gnome Foods (please, kill me.) with no luck. Enough sapphires and rubies, and oddly enough red topaz, to power through to 200m crafting XP in no time though. \\*cries\\*\n\n&amp;#x200B;\n\nDoes anyone have suggestions?\n\nAs an ironman am I about to be locked from Fairy Rings for a fair amount of time?","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/10820mr\/uncut_diamond_help\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/10820mr\/uncut_diamond_help\/","created_at_timestamp":"2023-01-10 12:49 AM","created_at_date":"2023-01-10"},{"title":"Username Issue","content":"A username I really want for a f2p account I'm trying to make I'm being told is unavailable, but if I try and change my main accounts name to the name that I'm being told is unavailable it is letting me... How do I get around this? While still staying free to play","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108g0x1\/username_issue\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108g0x1\/username_issue\/","created_at_timestamp":"2023-01-10 12:49 PM","created_at_date":"2023-01-10"},{"title":"u\/unratedex stop msging me you like daycares","content":"[removed]","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108g1i0\/uunratedex_stop_msging_me_you_like_daycares\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108g1i0\/uunratedex_stop_msging_me_you_like_daycares\/","created_at_timestamp":"2023-01-10 12:50 PM","created_at_date":"2023-01-10"},{"title":"2 kits 1 chest","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108238c\/2_kits_1_chest\/","url":"https:\/\/i.redd.it\/2v4g4t5857ba1.jpg","created_at_timestamp":"2023-01-10 12:53 AM","created_at_date":"2023-01-10"},{"title":"Client update news?","content":"I' read somewhere they were going to update the client with new features? any news about that? I just use the steam\/mobile client.","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108g3sm\/client_update_news\/","url":"https:\/\/www.reddit.com\/r\/2007scape\/comments\/108g3sm\/client_update_news\/","created_at_timestamp":"2023-01-10 12:53 PM","created_at_date":"2023-01-10"},{"title":"My first 405 invo ToA completion. Guess I'm going back to 300's.","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/10824i7\/my_first_405_invo_toa_completion_guess_im_going\/","url":"https:\/\/i.redd.it\/pk9jy62pn5ba1.png","created_at_timestamp":"2023-01-10 12:55 AM","created_at_date":"2023-01-10"},{"title":"SOTE Completed! Thanks for the help + updated setup","content":"","subreddit":"2007scape","permalink":"\/r\/2007scape\/comments\/108g9vy\/sote_completed_thanks_for_the_help_updated_setup\/","url":"https:\/\/www.reddit.com\/gallery\/108g9vy","created_at_timestamp":"2023-01-10 12:59 PM","created_at_date":"2023-01-10"}]